lern_tax/app/controllers/concerns/current_user_concern.rb

SELECT "tax_informations".* FROM "tax_informations" WHERE "tax_informations"."information_id" = $1  [["information_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_current_user
        if session[:user_id]
        #  @current_user = User.find(session[:user_id]).as_json(include: :information)
        @current_user = User.find(session[:user_id]).as_json(:include => [:information => {:include => :tax_information}])