lern_tax/app/controllers/information_controller.rb

  def index
    @information = Information.all
---
SELECT "tax_informations".* FROM "tax_informations" WHERE "tax_informations"."information_id" = $1  [["information_id", 1]]

  def create
    # if Information.where(information: params[:user_id]).first
    #    render json: {status: "You have information!"}
    # else
       @information = Information.new(information_params)

      respond_to do |format|
        if @information.save
---
INSERT INTO "information" ("name", "age", "marital_status", "state", "dependent", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @information.update(information_params)
---
UPDATE "information" SET "name" = $1, "age" = $2, "marital_status" = $3, "updated_at" = $4 WHERE "information"."id" = $5  [["name", "M. Brock Podgurski"], ["age", 18], ["marital_status", "Head Of Household"], ["updated_at", "2020-08-14 22:17:04.513942"], ["id", 1]]

    def set_information
      @information = Information.find(params[:id])
---
SELECT "information".* FROM "information" WHERE "information"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]