app/controllers/tax_informations_controller.rb

  def index
    @tax_informations = TaxInformation.all
---
SELECT "tax_informations".* FROM "tax_informations"

  def create
    @tax_information = TaxInformation.new(tax_information_params)

    respond_to do |format|
      if @tax_information.save
---
INSERT INTO "tax_informations" ("w2_wages", "capital_gains", "unemployment_insurance", "self_employment", "created_at", "updated_at", "information_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_tax_information
      @tax_information = TaxInformation.find(params[:id])
---
SELECT "tax_informations".* FROM "tax_informations" WHERE "tax_informations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]